// // 3. Напишите программу, которая принимает на вход число (N) 
//    и выдаёт таблицу квадратов чисел от 1 до N.

void Kvad (int num)
{
  int num_1 = 1;
  while (num_1 <= num)
  {
    int result = num * num;
    num_1 = num_1 + 1;
    return;
  }
}
  int num = int.Parse(Console.WriteLine()!);
  Kvad(num);